# Программа проверяет является ли число положительным
# Или отрицательным и выводит соответствующее сообщение

num = 3

# Также попробуйте след. варианты значения num
# num = -5
# num = 0

# if num >= 0:
#     print ('Число больше или равно 0')
# else:
#     print('Число отрицательное')



# str_2 содержит в себе str_1 ?

# str_1 = 'test'
# str_2 = 'test1'

def task_yes_no (str_1, str_2):
    if str_1 in str_2:
        print('ДА')
    else:
        print('НЕТ')

task_yes_no(str_1 = 'test', str_2 = 'test1')

